chapters/public_html/chapter01-初识窗口__section03-窗口的ATL封装.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>1.3 窗口的ATL封装</title>
<!-- 2016-06-16 周四 23:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="keinvo" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="http://www.i3s.unice.fr/~malapert/css/worg.min.css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">1.3 窗口的ATL封装</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1.3.1 ATL::CWindow</a></li>
<li><a href="#sec-2">1.3.2 ATL::CWindowImpl</a>
<ul>
<li><a href="#sec-2-1">ATL::CWindowImpl的消息处理</a></li>
<li><a href="#sec-2-2">ATL::CWindowImpl的消息映射宏</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
在没有任何辅组的情况下进行界面编程是比较繁琐复杂的，从上一节我们看到，仅仅是实现一个最简单的窗口就需要几十行代码。除此之外，windows界面编程另一个烦人的事情是我们只能在窗口过程WndProc里面去处理界面消息，为了实现一个简单的窗口，我们往往需要处理大量的Windows消息，这么大量的消息处理都放在WndProc里面，会出现一个很臃肿的switch..case结构。为了简化界面编程，ATL提供了相应的封装。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">1.3.1 ATL::CWindow</h2>
<div class="outline-text-2" id="text-1">
<p>
ATL::CWindow提供了对HWND和user32.dll导出函数的封装。在ATL::CWindow的定义里我们可以看到，CWindow的其中一个成员变量就是HWND m_hWnd。在界面编程中，我们所有的界面操作都需要指定作用在哪个窗口上，所以几乎所有的user32导出函数都需要提供HWND作为第一个参数，CWindow封装了这些函数，提供了无HWND参数的版本。
</p>

<div class="org-src-container">

<pre class="src src-C++">class CWindow
{
public:
    HWND m_hWnd;

    CWindow(HWND hWnd = NULL) throw() :
        m_hWnd(hWnd)
    {
    }

    CWindow&amp; operator=(HWND hWnd) throw()
    {
        m_hWnd = hWnd;
        return *this;
    }

    // ...

    HWND Create(LPCTSTR lpstrWndClass, HWND hWndParent, _U_RECT rect = NULL, LPCTSTR szWindowName = NULL,
            DWORD dwStyle = 0, DWORD dwExStyle = 0,
            _U_MENUorID MenuOrID = 0U, LPVOID lpCreateParam = NULL) throw()
    {
        // ...

        HWND hWnd = ::CreateWindowEx( ... );

        ATLASSUME(m_hWnd == hWnd);

        return hWnd;
    }

    // ...
}
</pre>
</div>
<p>
有了CWindow，我们原先的下面代码
</p>
<div class="org-src-container">

<pre class="src src-C++">int APIENTRY _tWinMain(HINSTANCE hinst,
                    HINSTANCE /*hinstPrev*/,
                    LPTSTR pszCmdLine,
                    int nCmdShow) {
    // Register the main window class
    // ...

    HWND hwnd = ::CreateWindowEx(WS_EX_CLIENTEDGE,
                            pszMainWndClass,
                            __T("Windows Application"),
                            WS_OVERLAPPEDWINDOW,
                            CW_USEDEFAULT, 0,
                            CW_USEDEFAULT, 0,
                            0, 0, hinst, 0);
    if( !hwnd ) return -1;

    ::ShowWindow(hwnd, nCmdShow);
    ::UpdateWindow(hwnd);

    // Main message loop
    // ...
}

LRESULT CALLBACK WndProc(HWND hwnd, UINT nMsg, WPARAM wparam,LPARAM lparam) {
    switch( nMsg ) {
    case WM_PAINT: {
        PAINTSTRUCT ps;
        HDC hdc = ::BeginPaint(hwnd, &amp;ps);
        RECT rect; ::GetClientRect(hwnd, &amp;rect);
        ::DrawText(hdc, __T("Hello, Windows"), -1, &amp;rect, 
            DT_CENTER | DT_VCENTER | DT_SINGLELINE);
        ::EndPaint(hwnd, &amp;ps);
    }
    break;

    // ...

    default:
        return ::DefWindowProc(hwnd, nMsg, wparam, lparam);
        break;
    }

    // ...
}
</pre>
</div>
<p>
除了DefWindowProc，其他用到hwnd的地方(CreateWindowEx, ShowWindow, UpdateWindow等等)，我们都可以用CWindow实现
</p>
<div class="org-src-container">

<pre class="src src-C++">int APIENTRY _tWinMain(HINSTANCE hinst,
                       HINSTANCE /*hinstPrev*/,
                       LPTSTR    pszCmdLine,
                       int       nCmdShow) {
    // Register the main window class
    // ...

    // Create the main window
    CWindow wnd;
    wnd.Create(pszMainWndClass, NULL, CWindow::rcDefault, 
        __T("Windows Application"), WS_OVERLAPPEDWINDOW);
    if (!wnd){ return -1; }

    // Show the main window
    wnd.ShowWindow(nCmdShow);
    wnd.UpdateWindow();

    // Main message loop
    MSG msg;
    while( GetMessage(&amp;msg, 0, 0, 0) ) {
       TranslateMessage(&amp;msg);
       DispatchMessage(&amp;msg);
    }

    return msg.wParam;
}

LRESULT CALLBACK WndProc(HWND hwnd, UINT nMsg, WPARAM wparam,
                         LPARAM lparam) {
    CWindow wnd(hwnd);
    switch( nMsg ) {
        case WM_PAINT: {
            PAINTSTRUCT ps;
            HDC hdc = wnd.BeginPaint(&amp;ps);
            RECT rect = {0};
            wnd.GetClientRect(&amp;rect);
            ::DrawText(hdc, __T("Hello, Windows"), -1, &amp;rect,
              DT_CENTER | DT_VCENTER | DT_SINGLELINE);
            wnd.EndPaint(&amp;ps);
            }
            break;

        // ...

        default:
            return ::DefWindowProc(hwnd, nMsg, wparam, lparam);
            break;
    }

    return 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">1.3.2 ATL::CWindowImpl</h2>
<div class="outline-text-2" id="text-2">
<p>
ATL::CWindow对HWND的封装看上去并没有为我们减少多少代码量，下面我们要介绍的ATL::CWindowImpl将真正简化我们的窗口程序。CWindowImpl提供了窗口创建过程和消息处理等一系列操作的封装。
</p>
<div class="org-src-container">

<pre class="src src-C++">template &lt;class T, class TBase /* = CWindow */, class TWinTraits /* = CControlWinTraits */&gt;
class ATL_NO_VTABLE CWindowImpl :
    public CWindowImplBaseT&lt; TBase, TWinTraits &gt;
{
public:
    DECLARE_WND_CLASS(NULL)

    HWND Create(
        _In_opt_ HWND hWndParent,
        _In_ _U_RECT rect = NULL,
        _In_opt_z_ LPCTSTR szWindowName = NULL,
        _In_ DWORD dwStyle = 0,
        _In_ DWORD dwExStyle = 0,
        _In_ _U_MENUorID MenuOrID = 0U,
        _In_opt_ LPVOID lpCreateParam = NULL)
    {
        // ...
    }
}
</pre>
</div>
<p>
可以看到CWindowImpl是一个模版类，实际从CWindow继承。CWindowImpl封装了窗口的注册和创建过程，有了CWindowImpl类后，我们的窗口创建部分可以这么写
</p>
<div class="org-src-container">

<pre class="src src-C++">class CMainWindow : public CWindowImpl&lt;CMainWindow&gt; {...};

// Entry point
int APIENTRY _tWinMain(HINSTANCE hinst,
  HINSTANCE /*hinstPrev*/,
  LPTSTR    pszCmdLine,
  int       nCmdShow) {

  // Initialize global strings
  LoadString(hInstance, IDS_APP_TITLE, szTitle, MAX_LOADSTRING);

  CMainWindow wnd;

  wnd.Create( 0, CWindow::rcDefault, szTitle,
    WS_OVERLAPPEDWINDOW, WS_EX_CLIENTEDGE );
  if( !wnd ) {
    return FALSE;
  }
  wnd.CenterWindow( );
  wnd.ShowWindow( nCmdShow );
  wnd.UpdateWindow( );

  // Show the main window, run the message loop
  ...

  return msg.wParam;
}
</pre>
</div>
<p>
我们基于CWindowImpl实现了一个窗口类CMainWindow，创建窗口的时候，直接定义一个实例wnd，调用其成员函数Create就创建了一个窗口，CWindowImpl替我们完成了窗口的注册和CreateWindowEx的调用。
</p>

<p>
上面就是CWindowImpl对窗口注册和创建过程的简化，下面我们将讨论CWindowImpl对窗口过程(WndProc)的封装。在此之前，有必要先了解一下Thunk技术，CWindowImpl对窗口过程的封装就是利用Thunk技术实现的。
</p>
</div>
