chapters/org/chapter01-初识窗口__section03-窗口的ATL封装.org
*** ATL::CWindowImpl的消息处理
我们知道，一个窗口的窗口过程是在注册窗口的时候由WNDCLASSEX结构的lpfnWndProc字段指定，前面我们创建窗口时指定WndProc为我们的窗口过程
#+BEGIN_SRC C++
	LPCTSTR     pszMainWndClass = __T("HelloWinApp");
    WNDCLASSEX  wc = { sizeof(WNDCLASSEX) };
    // ...
    wc.lpszClassName = pszMainWndClass;
    wc.lpfnWndProc = WndProc;
    if( !::RegisterClassEx(&wc) ) return -1;
#+END_SRC
前面我们提到过，Windows界面编程往往需要处理大量的消息，这些消息又必须在WndProc里处理，这样会导致一个臃肿的switch...case结构。比这更严重的是，WndProc不能为类的普通成员函数（因为类的普通成员函数调用参数需要一个this指针，而WndProc不满足。），只能作为类的静态成员函数，导致WndProc只能访问全局变量、调用全局的函数，这样实际上是非常不方便的。我们希望能像下面这样处理窗口消息
#+BEGIN_SRC C++
class CMainWindow
{
    LRESULT HandleMsg(HWND hwnd, UINT nMsg, WPARAM wparam, LPARAM lparam) 
	{
	LRESULT lResult = 0;
    switch( nMsg ) {
        case WM_PAINT: HandleWMPaint(); break;
        case WM_DESTROY: HandleWMDestroy(); break;
		// ...
    }

	return lResult;
  }
}
#+END_SRC
下面我们来看看ATL::CWindowImpl如何通过thunk技术实现我们这个需求。

ATL::CWindowImpl的定义里我们看到有下面这行
#+BEGIN_SRC C++
DECLARE_WND_CLASS(NULL)
#+END_SRC
DECLARE_WND_CLASS是一个宏定义，它定义了一个CWndClassInfo结构的wc，并将CWndClassInfo结构的pWndProc字段初始化为StartWindowProc
#+BEGIN_SRC C++

struct _ATL_WNDCLASSINFOW
{
	WNDCLASSEXW m_wc;
	LPCWSTR m_lpszOrigName;
	WNDPROC pWndProc;
	LPCWSTR m_lpszCursorID;
	BOOL m_bSystemCursor;
	ATOM m_atom;
	WCHAR m_szAutoName[5+sizeof(void*)*CHAR_BIT];

	ATOM Register(_In_ WNDPROC* p)
	{
		return AtlWinModuleRegisterWndClassInfoW(&_AtlWinModule, &_AtlBaseModule, this, p);
	}
};

typedef _ATL_WNDCLASSINFOW CWndClassInfoW;

// ...

#define DECLARE_WND_CLASS(WndClassName) \
static ATL::CWndClassInfo& GetWndClassInfo() \
{ \
	static ATL::CWndClassInfo wc = \
	{ \
		{ sizeof(WNDCLASSEX), CS_HREDRAW | CS_VREDRAW | CS_DBLCLKS, StartWindowProc, \
		  0, 0, NULL, NULL, NULL, (HBRUSH)(COLOR_WINDOW + 1), NULL, WndClassName, NULL }, \
		NULL, NULL, IDC_ARROW, TRUE, 0, _T("") \
	}; \
	return wc; \
}
#+END_SRC
这里指定了窗口过程为StartWindowProc，不再是我们之前的WndProc了。StartWindowProc是在CWindowImpl的基类CWindowImplBaseT里实现的。
#+BEGIN_SRC C++
template <class TBase, class TWinTraits>
LRESULT CALLBACK CWindowImplBaseT< TBase, TWinTraits >::StartWindowProc(
	_In_ HWND hWnd,
	_In_ UINT uMsg,
	_In_ WPARAM wParam,
	_In_ LPARAM lParam)
{
	CWindowImplBaseT< TBase, TWinTraits >* pThis = (CWindowImplBaseT< TBase, TWinTraits >*)_AtlWinModule.ExtractCreateWndData();
	ATLASSERT(pThis != NULL);
	if(!pThis)
	{
		return 0;
	}
	pThis->m_hWnd = hWnd;

	// Initialize the thunk.  This is allocated in CWindowImplBaseT::Create,
	// so failure is unexpected here.

	pThis->m_thunk.Init(pThis->GetWindowProc(), pThis);
	WNDPROC pProc = pThis->m_thunk.GetWNDPROC();
	WNDPROC pOldProc = (WNDPROC)::SetWindowLongPtr(hWnd, GWLP_WNDPROC, (LONG_PTR)pProc);
#ifdef _DEBUG
	// check if somebody has subclassed us already since we discard it
	if(pOldProc != StartWindowProc)
		ATLTRACE(atlTraceWindowing, 0, _T("Subclassing through a hook discarded.\n"));
#else
	(pOldProc);	// avoid unused warning
#endif
	return pProc(hWnd, uMsg, wParam, lParam);
}
#+END_SRC
我们看到，这里用到了thunk，再看一下这个thunk的定义，在atlstdthunk.h里有多个针对不同平台的thunk定义，我们只看x86平台
#+BEGIN_SRC C++
#if defined(_M_IX86)
PVOID __stdcall __AllocStdCallThunk(VOID);
VOID  __stdcall __FreeStdCallThunk(_In_opt_ PVOID);

#pragma pack(push,1)
struct _stdcallthunk
{
	DWORD   m_mov;          // mov dword ptr [esp+0x4], pThis (esp+0x4 is hWnd)
	DWORD   m_this;         //
	BYTE    m_jmp;          // jmp WndProc
	DWORD   m_relproc;      // relative jmp
	BOOL Init(
		_In_ DWORD_PTR proc,
		_In_opt_ void* pThis)
	{
		m_mov = 0x042444C7;  //C7 44 24 0C
		m_this = PtrToUlong(pThis);
		m_jmp = 0xe9;
		m_relproc = DWORD((INT_PTR)proc - ((INT_PTR)this+sizeof(_stdcallthunk)));
		// write block from data cache and
		//  flush from instruction cache
		FlushInstructionCache(GetCurrentProcess(), this, sizeof(_stdcallthunk));
		return TRUE;
	}
	//some thunks will dynamically allocate the memory for the code
	void* GetCodeAddress()
	{
		return this;
	}
	_Ret_opt_bytecount_x_(sizeof(_stdcallthunk)) void* operator new(_In_ size_t)
	{
        return __AllocStdCallThunk();
    }
    void operator delete(_In_opt_ void* pThunk)
    {
        __FreeStdCallThunk(pThunk);
    }
};
#pragma pack(pop)
#+END_SRC
可以看到，基本和我们的thunk一样。

回到StartWindowProc，我们看到thunk初始化传入的实际窗口过程是WindowProc
#+BEGIN_SRC C++
pThis->m_thunk.Init(pThis->GetWindowProc(), pThis);

virtual WNDPROC GetWindowProc()
{
	return WindowProc;
}
#+END_SRC
#+BEGIN_SRC C++
template <class TBase, class TWinTraits>
LRESULT CALLBACK CWindowImplBaseT< TBase, TWinTraits >::WindowProc(
	_In_ HWND hWnd,
	_In_ UINT uMsg,
	_In_ WPARAM wParam,
	_In_ LPARAM lParam)
{
	CWindowImplBaseT< TBase, TWinTraits >* pThis = (CWindowImplBaseT< TBase, TWinTraits >*)hWnd;
	// set a ptr to this message and save the old value
	_ATL_MSG msg(pThis->m_hWnd, uMsg, wParam, lParam);
	const _ATL_MSG* pOldMsg = pThis->m_pCurrentMsg;
	pThis->m_pCurrentMsg = &msg;
	// pass to the message map to process
	LRESULT lRes = 0;
	BOOL bRet = pThis->ProcessWindowMessage(pThis->m_hWnd, uMsg, wParam, lParam, lRes, 0);

	// ...
}
#+END_SRC
WindowProc里获取到pThis指针之后，直接将所有消息都传给成员函数ProcessWindowMessage处理。到这里就是这个thunk的全部工作，下面的消息处理，就可以由ProcessWindowMessage函数再根据不同消息分发给不同的成员函数。

利用ATL::CWindowImpl，我们的窗口框架可以改写成这样

#+BEGIN_SRC C++
#include "stdafx.h" // Includes windows.h and tchar.h
#include <atlbase.h>
#include <atlwin.h>

class CMainWindow : public CWindowImpl<CMainWindow>
{
public:
    virtual BOOL ProcessWindowMessage(HWND hwnd, UINT nMsg, WPARAM wparam,
                                    LPARAM lparam, LRESULT &lResult, DWORD /*dwMsgMapID*/) {
    BOOL bHandled = TRUE;
    
    switch( nMsg ) {
        case WM_PAINT: lResult = OnPaint(); break;
        case WM_DESTROY: lResult = OnDestroy(); break;
        default: bHandled = FALSE; break;
    }

	return bHandled;
  }

private:
    LRESULT OnPaint() {
        PAINTSTRUCT ps;
        HDC hdc = BeginPaint(&ps);
        RECT rect; GetClientRect(&rect);
        DrawText(hdc, __T("Hello Windows !"), -1, &rect,
             DT_CENTER | DT_VCENTER | DT_SINGLELINE);
        EndPaint(&ps);
        return 0;
    }
    LRESULT OnDestroy() {
        PostQuitMessage(0);
        return 0;
    }
};

int APIENTRY _tWinMain(HINSTANCE hinst,
					   HINSTANCE /*hinstPrev*/,
					   LPTSTR    pszCmdLine,
					   int       nCmdShow) {
    CMainWindow wnd;
    wnd.Create(0, CWindow::rcDefault, _T("CWindowImpl Demo"), WS_OVERLAPPEDWINDOW, WS_EX_CLIENTEDGE);
    if(!wnd) { return -1; }

    wnd.CenterWindow();
    wnd.ShowWindow(nCmdShow);
    wnd.UpdateWindow();

    MSG msg;
    while( GetMessage(&msg, 0, 0, 0) ) {
       TranslateMessage(&msg);
       DispatchMessage(&msg);
    }
  
	return msg.wParam;
}

#+END_SRC

