chapters/public_html/chapter01-初识窗口__section03-窗口的ATL封装.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">ATL::CWindowImpl的消息映射宏</h3>
<div class="outline-text-3" id="text-2-2">
<p>
除了利用thunk技术将消息转发给成员函数处理，ATL还提供了一组宏来进一步简化消息处理过程。这组宏通过建立消息和处理函数的一对一映射，省去了编写ProcessWindowMessage。这组宏以GEGIN_MSG_MAP开始，END_MSG_MAP结束。
</p>
<div class="org-src-container">

<pre class="src src-C++">#define BEGIN_MSG_MAP(theClass) \
public: \
    BOOL ProcessWindowMessage(_In_ HWND hWnd, _In_ UINT uMsg, _In_ WPARAM wParam,\
        _In_ LPARAM lParam, _Inout_ LRESULT&amp; lResult, _In_ DWORD dwMsgMapID = 0) \
    { \
        BOOL bHandled = TRUE; \
        (hWnd); \
        (uMsg); \
        (wParam); \
        (lParam); \
        (lResult); \
        (bHandled); \
        switch(dwMsgMapID) \
        { \
        case 0:

// ...

#define END_MSG_MAP() \
            break; \
        default: \
            ATLTRACE(ATL::atlTraceWindowing, 0, _T("Invalid message map ID (%i)\n"), dwMsgMapID); \
            ATLASSERT(FALSE); \
            break; \
        } \
        return FALSE; \
    }
</pre>
</div>
<p>
BEGIN_MSG_MAP和END_MSG_MAP组成了一个ProcessWindowMessage函数，针对不同的消息，通过switch&#x2026;case分发到不同的处理函数。
分发不同消息的宏是MESSAGE_HANDLER
</p>
<div class="org-src-container">

<pre class="src src-C++">#define MESSAGE_HANDLER(msg, func) \
    if(uMsg == msg) \
    { \
        bHandled = TRUE; \
        lResult = func(uMsg, wParam, lParam, bHandled); \
        if(bHandled) \
            return TRUE; \
    }
</pre>
</div>
<p>
比如，我们要指定WM_PAINT的处理函数OnPaint，就可以这么写
</p>
<div class="org-src-container">

<pre class="src src-C++">BEGIN_MSG_MAP()
    MESSAGE_HANDLER(WM_PAINT, OnPaint)
END_MSG_MAP()
</pre>
</div>

<p>
于是，我们的窗口框架可以进一步简化
</p>
<div class="org-src-container">

<pre class="src src-C++">#include "stdafx.h" // Includes windows.h and tchar.h
#include &lt;atlbase.h&gt;
#include &lt;atlwin.h&gt;

class CMainWindow : public CWindowImpl&lt;CMainWindow&gt;
{
    BEGIN_MSG_MAP(CMainWindow)
        MESSAGE_HANDLER(WM_PAINT, OnPaint)
        MESSAGE_HANDLER(WM_DESTROY, OnDestroy)
    END_MSG_MAP()

private:
    LRESULT OnPaint(UINT nMsg, WPARAM wParam, LPARAM lParam, BOOL &amp;bHandled) {
        PAINTSTRUCT ps;
        HDC hdc = BeginPaint(&amp;ps);
        RECT rect; GetClientRect(&amp;rect);
        DrawText(hdc, __T("Hello Windows !"), -1, &amp;rect,
             DT_CENTER | DT_VCENTER | DT_SINGLELINE);
        EndPaint(&amp;ps);

        bHandled = TRUE;
        return 0;
    }
    LRESULT OnDestroy(UINT nMsg, WPARAM wParam, LPARAM lParam, BOOL &amp;bHandled) {
        PostQuitMessage(0);

        bHandled = TRUE;
        return 0;
    }
};

int APIENTRY _tWinMain(HINSTANCE hinst,
                       HINSTANCE /*hinstPrev*/,
                       LPTSTR    pszCmdLine,
                       int       nCmdShow) {
    CMainWindow wnd;
    wnd.Create(0, CWindow::rcDefault, _T("CWindowImpl Demo"), WS_OVERLAPPEDWINDOW, WS_EX_CLIENTEDGE);
    if(!wnd) { return -1; }

    wnd.CenterWindow();
    wnd.ShowWindow(nCmdShow);
    wnd.UpdateWindow();

    MSG msg;
    while( GetMessage(&amp;msg, 0, 0, 0) ) {
       TranslateMessage(&amp;msg);
       DispatchMessage(&amp;msg);
    }

    return msg.wParam;
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: keinvo</p>
<p class="date">Created: 2016-06-16 周四 23:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
